# US - Baby Names



### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset

In [3]:
pd.read_csv("US_Baby_Names.csv")

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 3. Assign it to a variable called baby_names.

In [4]:
baby_names=pd.read_csv("US_Baby_Names.csv")

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names.drop(columns={'Unnamed: 0','Id'},inplace=True)

In [9]:
# del baby_names['Unnamed: 0']
# del baby_names['Id']

baby_names.columns

Index(['Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

### Step 6. Is there more male or female names in the dataset?

In [ ]:
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

In [37]:
baby_names.value_counts("Gender").reset_index().rename(columns={"count":"Total"})

  Gender   Total
0      F  558846
1      M  457549

In [ ]:
baby_names.groupby("Gender").agg({"Count": "sum"}).sort_values("Count", ascending=False)[:1]

           Count
Gender
M       19041199

### Step 7. Group the dataset by name and assign to names

In [ ]:
# Generate a new DataFrame or Series with the index reset.
# This is useful when the index needs to be treated as a column, or 
# when the index is meaningless and needs to be reset to the default before another operation.

names = baby_names.groupby("Name").Gender.count().sort_values(ascending=False).reset_index().rename(columns={"Gender":"Total_Count"})
names

          Name  Total_Count
0        Riley         1112
1        Avery         1080
2       Jordan         1073
3       Peyton         1064
4       Hayden         1049
...        ...          ...
17627    Ethon            1
17628  Malajah            1
17629     Euan            1
17630   Azyria            1
17631   Nissen            1

[17632 rows x 2 columns]

In [7]:
name2 = baby_names.Name.value_counts()

In [14]:
name2 = baby_names.groupby("Name").count()

In [16]:
name2.Count

Name
Aaban        2
Aadan        4
Aadarsh      1
Aaden      196
Aadhav       1
          ...
Zyra         7
Zyrah        2
Zyren        1
Zyria       10
Zyriah       9
Name: Count, Length: 17632, dtype: int64

### Step 8. How many different names exist in the dataset?

In [39]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [ ]:
baby_names['Name'].value_counts()[:1]

Name
Riley    1112
Name: count, dtype: int64

In [40]:
names[:1]

    Name  Total_Count
0  Riley         1112

### Step 10. How many different names have the least occurrences?

In [42]:
len(names[names['Total_Count']==names['Total_Count'].min()])

3682

### Step 11. What is the median name occurrence?

In [43]:
baby_names.Name.value_counts().median()

8.0

In [45]:
names['Total_Count'].median()

8.0

### Step 12. What is the standard deviation of names?

In [48]:
round(names['Total_Count'].std(),2)

122.03

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [52]:
round(names.describe().reset_index().rename(columns={"index":"Summary"}),2)

  Summary  Total_Count
0   count     17632.00
1    mean        57.64
2     std       122.03
3     min         1.00
4     25%         2.00
5     50%         8.00
6     75%        39.00
7     max      1112.00